In [7]:
import numpy as np
import pandas as pd

In [11]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [14]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [15]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [17]:
string_data[0] = None

In [19]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [20]:
from numpy import nan as NA

In [21]:
data = pd.Series([1,NA,3.5,NA,7])

In [22]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [23]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [24]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [25]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
clean = data.dropna()

In [27]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [29]:
clean

     0    1    2
0  1.0  6.5  3.0

In [30]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [33]:
data[4]= NA

In [34]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [35]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [36]:
df = pd.DataFrame(np.random.randn(7,3))

In [37]:
df

          0         1         2
0 -0.605729  0.980514 -0.545965
1  0.099965 -0.029304 -0.781169
2  0.228026  0.102423  0.228519
3  0.307605 -0.088789  1.290337
4  0.466394 -1.073804 -1.068249
5 -1.200225 -0.371772  0.542414
6 -0.232199  1.653428  0.207611

In [38]:
df.iloc[:4,1] = NA

In [39]:
df.iloc[:2,2] = NA

In [40]:
df

          0         1         2
0 -0.605729       NaN       NaN
1  0.099965       NaN       NaN
2  0.228026       NaN  0.228519
3  0.307605       NaN  1.290337
4  0.466394 -1.073804 -1.068249
5 -1.200225 -0.371772  0.542414
6 -0.232199  1.653428  0.207611

In [41]:
df.dropna()

          0         1         2
4  0.466394 -1.073804 -1.068249
5 -1.200225 -0.371772  0.542414
6 -0.232199  1.653428  0.207611

In [42]:
df.dropna(thresh=2)

          0         1         2
2  0.228026       NaN  0.228519
3  0.307605       NaN  1.290337
4  0.466394 -1.073804 -1.068249
5 -1.200225 -0.371772  0.542414
6 -0.232199  1.653428  0.207611

In [43]:
df.fillna(0)

          0         1         2
0 -0.605729  0.000000  0.000000
1  0.099965  0.000000  0.000000
2  0.228026  0.000000  0.228519
3  0.307605  0.000000  1.290337
4  0.466394 -1.073804 -1.068249
5 -1.200225 -0.371772  0.542414
6 -0.232199  1.653428  0.207611

In [44]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.605729  0.500000  0.000000
1  0.099965  0.500000  0.000000
2  0.228026  0.500000  0.228519
3  0.307605  0.500000  1.290337
4  0.466394 -1.073804 -1.068249
5 -1.200225 -0.371772  0.542414
6 -0.232199  1.653428  0.207611

In [47]:
_ = df.fillna(0,inplace=True)

In [48]:
df

          0         1         2
0 -0.605729  0.000000  0.000000
1  0.099965  0.000000  0.000000
2  0.228026  0.000000  0.228519
3  0.307605  0.000000  1.290337
4  0.466394 -1.073804 -1.068249
5 -1.200225 -0.371772  0.542414
6 -0.232199  1.653428  0.207611

In [49]:
df = pd.DataFrame(np.random.randn(6,3))

In [50]:
df.iloc[:2,1] = NA

In [51]:
df.iloc[4:,2] = NA

In [52]:
df

          0         1         2
0 -0.575432       NaN  0.181182
1 -0.450394       NaN -0.599466
2 -0.400845 -0.618354  0.564405
3 -1.029446 -1.698083  0.539718
4 -0.470381 -3.194709       NaN
5  0.345765  0.977479       NaN

In [56]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.575432       NaN  0.181182
1 -0.450394       NaN -0.599466
2 -0.400845 -0.618354  0.564405
3 -1.029446 -1.698083  0.539718
4 -0.470381 -3.194709  0.539718
5  0.345765  0.977479  0.539718

In [57]:
data = pd.Series([1.,NA,3.5,NA,7])

In [61]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [62]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})

In [63]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [64]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [65]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [66]:
data['v1'] = range(7)

In [67]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [68]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [69]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                     'Pastrami', 'corned beef', 'Bacon',
                     'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [70]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [71]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [72]:
lowercased = data['food'].str.lower()

In [73]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [74]:
data['animal'] = lowercased.map(meat_to_animal)

In [75]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [77]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [78]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [79]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [80]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [81]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [82]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [83]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [84]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [85]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [87]:
transform = lambda x: x[:4].upper()

In [88]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [90]:
data.index = data.index.map(transform)

In [91]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [92]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [93]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [94]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [95]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)

In [96]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [97]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [98]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [99]:
bins = [18,25,35,60,100]

In [100]:
cats = pd.cut(ages,bins)

In [103]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [104]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [106]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [107]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [108]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [109]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']

In [110]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [111]:
data = np.random.rand(20)

In [115]:
pd.cut(data,4,precision=2)

[(0.00046, 0.24], (0.47, 0.71], (0.00046, 0.24], (0.71, 0.95], (0.47, 0.71], ..., (0.00046, 0.24], (0.71, 0.95], (0.24, 0.47], (0.47, 0.71], (0.47, 0.71]]
Length: 20
Categories (4, interval[float64]): [(0.00046, 0.24] < (0.24, 0.47] < (0.47, 0.71] < (0.71, 0.95]]

In [116]:
data = np.random.randn(1000)

In [117]:
cats = pd.qcut(data,4)

In [118]:
cats

[(-3.848, -0.808], (-0.808, -0.0523], (-3.848, -0.808], (-0.808, -0.0523], (-3.848, -0.808], ..., (-0.808, -0.0523], (-3.848, -0.808], (-3.848, -0.808], (-0.808, -0.0523], (0.617, 3.149]]
Length: 1000
Categories (4, interval[float64]): [(-3.848, -0.808] < (-0.808, -0.0523] < (-0.0523, 0.617] < (0.617, 3.149]]

In [120]:
pd.value_counts(cats)

(0.617, 3.149]       250
(-0.0523, 0.617]     250
(-0.808, -0.0523]    250
(-3.848, -0.808]     250
dtype: int64

In [121]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-3.848, -1.375], (-1.375, -0.0523], (-1.375, -0.0523], (-1.375, -0.0523], (-3.848, -1.375], ..., (-1.375, -0.0523], (-1.375, -0.0523], (-1.375, -0.0523], (-1.375, -0.0523], (1.25, 3.149]]
Length: 1000
Categories (4, interval[float64]): [(-3.848, -1.375] < (-1.375, -0.0523] < (-0.0523, 1.25] < (1.25, 3.149]]

In [124]:
data = pd.DataFrame(np.random.randn(1000,4))

In [125]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.063974    -0.016321    -0.041438     0.005989
std       0.993140     1.011253     1.019714     1.006929
min      -3.428631    -2.951950    -3.058963    -3.366788
25%      -0.742020    -0.735578    -0.722384    -0.699321
50%      -0.006463    -0.025720    -0.056261    -0.017827
75%       0.627261     0.707640     0.639707     0.736046
max       2.945200     2.652049     3.390639     3.302507

In [126]:
col = data[2]

In [127]:
col[np.abs(col) > 3]

37    -3.058963
271    3.390639
668    3.244219
984   -3.053183
Name: 2, dtype: float64

In [128]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
33   0.402801  1.848410 -1.335186 -3.366788
37   0.216408 -0.735516 -3.058963 -0.140185
271  0.645998  0.735445  3.390639 -0.785947
523 -3.428631 -0.152940 -1.029180 -0.037616
668 -1.935221  0.471496  3.244219 -0.401550
841  0.430381  0.950262 -1.295708  3.302507
984  1.193674 -0.595361 -3.053183  0.175656

In [129]:
data[np.abs(data) > 3] = np.sign(data)* 3

In [130]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.063546    -0.016321    -0.041961     0.006054
std       0.991778     1.011253     1.017383     1.004818
min      -3.000000    -2.951950    -3.000000    -3.000000
25%      -0.742020    -0.735578    -0.722384    -0.699321
50%      -0.006463    -0.025720    -0.056261    -0.017827
75%       0.627261     0.707640     0.639707     0.736046
max       2.945200     2.652049     3.000000     3.000000

In [132]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1  1.0 -1.0  1.0  1.0
2 -1.0 -1.0  1.0 -1.0
3  1.0 -1.0  1.0  1.0
4 -1.0 -1.0  1.0 -1.0

In [133]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [134]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [136]:
sampler = np.random.permutation(5)

In [137]:
sampler

array([4, 3, 2, 0, 1])

In [138]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [139]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7

In [140]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3

In [141]:
choices = pd.Series([5,7,-1,6,4])

In [142]:
draws = choices.sample(n=10,replace=True)

In [147]:
draws

0    5
4    4
2   -1
3    6
2   -1
0    5
1    7
0    5
0    5
1    7
dtype: int64

In [149]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [150]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [151]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [152]:
dummies = pd.get_dummies(df['key'],prefix='key')

In [153]:
df_with_dummy = df[['data1']].join(dummies)

In [154]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [155]:
mnames = ['movie_id', 'title', 'genres']

In [157]:
np.random.seed(12345)

In [158]:
values = np.random.rand(10)

In [159]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [160]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [161]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [162]:
val = 'a,b, guido'

In [163]:
val.split(',')

['a', 'b', ' guido']

In [164]:
pieces = [x.strip() for x in val.split(',')]

In [165]:
pieces

['a', 'b', 'guido']

In [166]:
first,second,third = pieces

In [167]:
first + '::' + second + '::' + third

'a::b::guido'

In [168]:
'::'.join(pieces)

'a::b::guido'

In [169]:
'guido' in val

True

In [170]:
val.index(',')

1

In [171]:
val.find(':')

-1

In [172]:
val.count(',')

2

In [173]:
val.replace(',',':')

'a:b: guido'

In [174]:
val.replace(',','')

'ab guido'

In [175]:
import re

In [176]:
text = 'foo     bar\t  baz   \tqux'

In [177]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [178]:
text

'foo     bar\t  baz   \tqux'

In [182]:
regex = re.compile('\s+')

In [183]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [184]:
regex.findall(text)

['     ', '\t  ', '   \t']

In [185]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [186]:
text

'Dave dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRyan ryan@yahoo.com\n'

In [187]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [188]:
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [189]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [191]:
regex

re.compile(r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}', re.IGNORECASE|re.UNICODE)

In [192]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [193]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [194]:
data = pd.Series(data)

In [195]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [196]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [197]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [198]:
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [199]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [dave@google.com]
Steve    [steve@gmail.com]
Rob        [rob@gmail.com]
Wes                    NaN
dtype: object

In [200]:
matches = data.str.match(pattern,flags=re.IGNORECASE)

In [201]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [202]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [203]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [204]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [ ]:
LLLLL